-- ตรวจสอบสต็อกการเติมสินค้า
-- คงเลือกรายล็อต  v_stock_by_lot = = รับเข้า − ขาย − สูญเสีย ⇒ คงเหลือต่อ ล็อต
-- species_id = รหัสเมล็ดพันธุ์ (รหัสประจำพืชเเต่ล่ะชนิด Primary Key)  / batch_id = รหัสล็อต (รหัสเเบ่งตามล็อตที่เข้ามา)

SELECT * FROM v_stock_by_lot ORDER BY species_id, batch_id;

/* แสดงผลจะเเสดง ข้อมูลของ v_stock_by_lot โดยเรียงจากน้อยไปหามากโดยใช้คำสั่ง ORDER BY 
มีการแสดงผลข้อมูล column batch_id,species_id,received_ts(วันเเละเวลาที่รับสินค้าล็อตนั้นเข้ามา),
qty_received(จำนวนสินค้าที่ล็อตนั้นเข้ามา),sold_qty(จำนวนสินค้าที่มีการขายออกล็อตนั้น),
lost_qty(สินค้าที่เกิดความเสียหายหรือสูญหาย),on_hand(สินค้าคงเหลือ sold_qty - lost_qty)*/
